//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2023, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************

/=#
#include "VFR.uni"


//----------------------------------------------------------------------------
//                 FIRMWARE VERSION
//----------------------------------------------------------------------------
#string STR_PSP_FWVERSION_FORM              #language eng   "PSP Firmware Versions"
#string STR_PSP_FWVERSION_FORM_HELP         #language eng   "PSP Firmware Versions"
#string STR_PSP_FIXED_REGION                #language eng   "PSP Directory Level 1 (Fixed)"
#string STR_PSP_UPDATABLE_REGION            #language eng   "PSP Directory Level 2 (Updateable)"
#string STR_PSP_BOT_VER_HELP                #language eng   "PSP BootLoader Version"
#string STR_PSP_BOT_VER_STRING              #language eng   "PSP BootLoader Version"
#string STR_PSP_BOT_VER_VALUE               #language eng   "N/A"

#string STR_PSP_BOT2_VER_HELP               #language eng   "PSP BootLoader 2 Version"
#string STR_PSP_BOT2_VER_STRING             #language eng   "PSP BootLoader 2 Version"
#string STR_PSP_BOT2_VER_VALUE              #language eng   "N/A"

#string STR_PSP_REC_VER_HELP                #language eng   "PSP Recovery BL Version"
#string STR_PSP_REC_VER_STRING              #language eng   "PSP Recovery BL Ver"
#string STR_PSP_REC_VER_VALUE               #language eng   "N/A"

#string STR_SMU_FW_VER_HELP                 #language eng   "SMU FW Version"
#string STR_SMU_FW_VER_STRING               #language eng   "SMU FW Version"
#string STR_SMU_FW_VER_VALUE_L2             #language eng   "N/A"
#string STR_SMU_FW_VER_VALUE_L1             #language eng   "N/A"
#string STR_SMU_FW_VER_VALUE                #language eng   "N/A"

#string STR_ABL_VER_HELP                    #language eng   "ABL Version"
#string STR_ABL_VER_STRING                  #language eng   "ABL Version"
#string STR_ABL_VER_VALUE_L2                #language eng   "N/A"
#string STR_ABL_VER_VALUE_L1                #language eng   "N/A"

#string STR_SEV_FW_VER_HELP                 #language eng   "SEV FW Version"
#string STR_SEV_FW_VER_STRING               #language eng   "SEV FW Version"
#string STR_SEV_FW_VER_VALUE_L1             #language eng   "N/A"

#string STR_TEE_VER_HELP                    #language eng   "PSP TEE Version"
#string STR_TEE_VER_STRING                  #language eng   "PSP TEE Version"
#string STR_TEE_VER_VALUE_L1                #language eng   "N/A"

#string STR_PHY_FW_VER_HELP                 #language eng   "PHY FW Version"
#string STR_PHY_FW_VER_STRING               #language eng   "PHY FW Version"
#string STR_PHY_FW_VER_VALUE_L1             #language eng   "N/A"

#string STR_MPIO_VER_HELP                   #language eng   "MPIO FW Version"
#string STR_MPIO_VER_STRING                 #language eng   "MPIO FW Version"
#string STR_MPIO_VER_VALUE_L1               #language eng   "N/A"

#string STR_TF_MPDMA_VER_HELP               #language eng   "TF MPDMA FW Version"
#string STR_TF_MPDMA_VER_STRING             #language eng   "TF MPDMA FW Version"
#string STR_TF_MPDMA_VER_VALUE_L1           #language eng   "N/A"

#string STR_PM_MPDMA_VER_HELP               #language eng   "PM MPDMA FW Version"
#string STR_PM_MPDMA_VER_STRING             #language eng   "PM MPDMA FW Version"
#string STR_PM_MPDMA_VER_VALUE_L1           #language eng   "N/A"

#string STR_GMI_VER_HELP                    #language eng   "GMI FW Version"
#string STR_GMI_VER_STRING                  #language eng   "GMI FW Version"
#string STR_GMI_VER_VALUE_L1                #language eng   "N/A"

#string STR_RIB_VER_HELP                    #language eng   "RIB FW Version"
#string STR_RIB_VER_STRING                  #language eng   "RIB FW Version"
#string STR_RIB_VER_VALUE_L1                #language eng   "N/A"

#string STR_SEC_VER_HELP                    #language eng   "SEC FW Version"
#string STR_SEC_VER_STRING                  #language eng   "SEC FW Version"
#string STR_SEC_VER_VALUE_L1                #language eng   "N/A"

#string STR_PMU_VER_HELP                    #language eng   "PMU FW Version"
#string STR_PMU_VER_STRING                  #language eng   "PMU FW Version"
#string STR_PMU_VER_VALUE_L1                #language eng   "N/A"

#string STR_EMCR_VER_HELP                   #language eng   "EMCR FW Version"
#string STR_EMCR_VER_STRING                 #language eng   "EMCR FW Version"
#string STR_EMCR_VER_VALUE_L1               #language eng   "N/A"

#string STR_uCA_FW_VER_HELP                 #language eng   "uCode A0 Version"
#string STR_uCA_FW_VER_STRING               #language eng   "uCode A0 Version"
#string STR_uCA_FW_VER_VALUE_L1             #language eng   "N/A"

#string STR_APCB_VER_HELP                   #language eng   "APCB Version"
#string STR_APCB_VER_STRING                 #language eng   "APCB Version"
#string STR_APCB_VER_VALUE_L2               #language eng   "N/A"
#string STR_APCB_VER_VALUE_L1               #language eng   "N/A"

#string STR_APOB_VER_HELP                   #language eng   "APOB Version"
#string STR_APOB_VER_STRING                 #language eng   "APOB Version"
#string STR_APOB_VER_VALUE_L2               #language eng   "N/A"
#string STR_APOB_VER_VALUE_L1               #language eng   "N/A"

#string STR_APPB_VER_HELP                   #language eng   "APPB Version"
#string STR_APPB_VER_STRING                 #language eng   "APPB Version"
#string STR_APPB_VER_VALUE_L2               #language eng   "N/A"
#string STR_APPB_VER_VALUE_L1               #language eng   "N/A"
